// pages/news-detail/news-detail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    teststring: "知乎上曾经有位大V，叫徐沪生，已经淡出大家的视野很久了，不知道多少人对他还有印象。他在知乎刚兴起，还只是在小圈子流行的时候，凭借一篇鸡汤文，描述他农村出身，竞赛保送上交，父亲重病没钱救治，同时他还是个同性恋，承受着想出柜而不能出柜的种种压力，一举成为知乎早期大V，圈粉无数，人气最高的时候每个回答点赞过千。甚至曾实名控诉蔡康永软弱，并自称同志领袖。不知道是因为知乎上的光环让他一度膨胀，还是急于想将名气变现，他在父亲病危，最需要钱的时候，毅然辞去了程序员的稳定工作，专心写书。没过多久，他父亲病逝，他的第一本书出版了，“少年啊前路漫漫”。作为他的早期粉丝，我读过他知乎上所有的文章，也曾加过他的微信。我买来这本书翻看了几页，便放下再也没打开过。关于他的书的评价，网上有很多，我不多作赘述。我只是懊悔，我明明早该意识到，他完全没有足够的人生阅历，也不具备写书的文笔和天赋。他的书，论内容论深度，还比不上《故事会》。在持续写书3年，陆陆续续出了5本差评连连的书后，在17年的平安夜，他发现自己把多年的积蓄全亏光了，不得不重新回去找工作。可他过惯了3年自由散漫的生活，同时也自断了编程的武功，高薪的工作根本找不到，低薪+坐班的工作对他完全是种折磨。在接连换了几份不如意的工作后，他开始卖起了保险。我奉劝在座的各位，无论男女，毒鸡汤少看。在互联网发达的年代，太多包藏祸心的毒鸡汤，打着“追求梦想”，“享受生活”的旗号，被包装成了励志的文章。其中，最典型的当属咪蒙劝人退学、“优秀的女人没有性生活”等等。我亲眼目睹身边太多人，喝多了毒鸡汤，做出种种匪夷所思的“追梦”行为。比如英国留学归来的某乖乖女，放弃稳定的银行工作，在微信卖起了烘焙点心。比如某位金融专业毕业的女生，放弃家里安排的券商的工作，零基础学起了画画，准备过几年开家工作室。其他放弃本职工作，半途而废，做起代购、花艺、直播的，数不胜数。我不是说这些行为有多么的不妥。只是庆幸，她们多数拥有优渥的家底，再怎么“追梦”，怎么“折腾”，都至少能保证下限，最不济也不过是阶层下滑。可是以毒鸡汤煽动人心的能力之强，覆盖范围之广，不可能只有那些家境优厚的人被洗脑，更多的是那些眼界局限、社会阅历不够丰富、农村出身的大学生，比如徐沪生。更讽刺的是——徐沪生本身就是靠写鸡汤文出位，只不过，写着写着，把自己给洗脑了。农村出身的大学生，没有家底没有财力没有人脉的支撑，在这个充满了诱惑和风险的世界，稍有不慎，多年来攀爬的努力将毁于一旦。更何况，我丝毫不认为他们中的绝大多数，是真的在“追梦”。我甚至诛心地认为，他们只是在自我欺骗，试图打着梦想的旗号，脱离这条艰辛但稳固的路，去选择一条更加轻松舒适的道路而已。在银行坐班，免不了赔笑受气；在互联网公司做程序员，免不了加班熬夜。他们避开复杂、艰辛的工作，选择轻松快活，毫无成长性的工作，但谁又能保证他们的将来呢？最后，那些和徐沪生同年毕业，一直在互联网公司工作的同学，到现在应该都快攒够在上海买房的首付了吧。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})